import {Component, OnInit} from '@angular/core';
import {Router} from '@angular/router';

@Component({
  selector: 'app-description',
  templateUrl: './description.component.html',
  styleUrls: ['./description.component.css']
})
export class DescriptionComponent implements OnInit {
title: string;
description: string;

  constructor(private router: Router) {
    switch (this.router.url){
      case '/AuditDuringReorganization':
        this.title = 'Аудит при реорганізації, ліквідації,банкрутстві підприємств';
        this.description = 'Аудит при реорганізації, ліквідації, банкрутстві підприємств – для підтвердження дійсної чистої вартості активів та зобов’язань підприємства.';
        break;
      case '/NationalAuditOfFinancialStatements':
        this.title = 'Національний аудит фінансової звітності';
        this.description = 'Національний (в т.ч. обов’язковий аудит) аудит фінансової звітності П(С)БО: \n' +
          '\n' +
          'перевірка даних бухгалтерського обліку та показників фінансової звітності суб’єкта господарювання з метою висловлення незалежної думки аудитора про її достовірність у всіх суттєвих аспектах та у відповідності з вимогами законів України, Національними стандартами бухгалтерського обліку, Міжнародними стандартами фінансової звітності та інших правил (внутрішніх положень суб’єктів господарювання) згідно вимог користувачів.';
        break;
      case '/InitiativeAudit':
        this.title = 'Ініціативний аудит';
        this.description = 'Ініціативний аудит – за вимогою або бажанням власників (учасників) та акціонерів підприємств будь-якої форми власності та інших користувачів фінансової звітності, в т.ч. оглядові перевірки.';
        break;
      case '/TaxAudit':
        this.title = 'Податковий аудит';
        this.description = 'незалежна  аудиторська перевірка податкового обліку та податкової звітності, метою якої є визначення правильності порядку обчислення та сплати податків до бюджету, а також відображення цих податків у регламентованій податковій звітності.';
        break;
      case '/SpecialPurposeAudit':
        this.title = 'Аудит спеціального призначення';
        this.description = 'Аудит спеціального призначення – для підтвердження достовірності обліку та відображення у звітності окремих аспектів діяльності підприємства, наприклад, обліку товарно-матеріальних цінностей або розрахунків з дебіторами та кредиторами, правильності розрахунку та сплати податків – податковий аудит.';
        break;
      case '/ComprehensiveOutsourcing':
        this.title = 'Комплексний аутсорсинг бухгалтерського обліку';
        this.description = 'Комплексний аутсорсинг бухгалтерського обліку включає наступні операції:\n' +
          '\n' +
          '    оформлення та обробка первинних документів, наданих замовником в електронному або паперовому вигляді;\n' +
          '    складання форм синтетичного та аналітичного обліку;\n' +
          '    розрахунок заробітної плати та інших виплат фізичним особам;\n' +
          '    складання регістрів податкового обліку, здача бухгалтерської звітності в ДПІ, фонди і органи статистики;\n' +
          '    розрахунок собівартості послуг і робіт, що виконуються компанією-замовником, оцінка облік основних та нематеріальних активів в т.ч. нарахування амортизації та проведення інвентаризацій;\n' +
          '    кур’єрські послуги.\n' +
          '    При необхідності в цей перелік може бути додатково включені інші послуги бухгалтерського обліку.\n';
        break;
      case '/AccountingWithTheDivisionOfPowers':
        this.title = 'Бухгалтерський облік з розподілом повноважень';
        break;
      case '/OutsourcingOfIndividualAreasOfAccounting':
        this.title = 'Аутсорсинг окремих ділянок бухгалтерського обліку';
        break;
      case '/TaxConsulting':
        this.title = 'Податковий консалтинг';
        break;
      case '/PreparationAndPreparationOfManagementReports':
        this.title = 'Постановка та підготовка управлінської звітності';
        break;
      case '/Recruitment':
        this.title = 'Підбір персоналу та тестування бухгалтерів';
        break;
      case '/TaxPlanning':
        this.title = 'Податкове планування';
        break;
    }
  }

  ngOnInit(): void {
  }

}
